mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1b8xf/common/s6e1b8xf.h
typedef struct stc_lcdc_lcdram26_field
{
    union {
        struct {
            __IO   uint8_t  LCDRAM               :8;
        };
        struct {
            __IO   uint8_t  LCDRAM0              :1;
            __IO   uint8_t  LCDRAM1              :1;
            __IO   uint8_t  LCDRAM2              :1;
            __IO   uint8_t  LCDRAM3              :1;
            __IO   uint8_t  LCDRAM4              :1;
            __IO   uint8_t  LCDRAM5              :1;
            __IO   uint8_t  LCDRAM6              :1;
            __IO   uint8_t  LCDRAM7              :1;
        };
    };
} stc_lcdc_lcdram26_field_t;

typedef struct stc_lcdc_lcdram27_field
{
    union {
        struct {
            __IO   uint8_t  LCDRAM               :8;
        };
        struct {
            __IO   uint8_t  LCDRAM0              :1;
            __IO   uint8_t  LCDRAM1              :1;
            __IO   uint8_t  LCDRAM2              :1;
            __IO   uint8_t  LCDRAM3              :1;
            __IO   uint8_t  LCDRAM4              :1;
            __IO   uint8_t  LCDRAM5              :1;
            __IO   uint8_t  LCDRAM6              :1;
            __IO   uint8_t  LCDRAM7              :1;
        };
    };
} stc_lcdc_lcdram27_field_t;

typedef struct stc_lcdc_lcdram28_field
{
    union {
        struct {
            __IO   uint8_t  LCDRAM               :8;
        };
        struct {
            __IO   uint8_t  LCDRAM0              :1;
            __IO   uint8_t  LCDRAM1              :1;
            __IO   uint8_t  LCDRAM2              :1;
            __IO   uint8_t  LCDRAM3              :1;
            __IO   uint8_t  LCDRAM4              :1;
            __IO   uint8_t  LCDRAM5              :1;
            __IO   uint8_t  LCDRAM6              :1;
            __IO   uint8_t  LCDRAM7              :1;
        };
    };
} stc_lcdc_lcdram28_field_t;

typedef struct stc_lcdc_lcdram29_field
{
    union {
        struct {
            __IO   uint8_t  LCDRAM               :8;
        };
        struct {
            __IO   uint8_t  LCDRAM0              :1;
            __IO   uint8_t  LCDRAM1              :1;
            __IO   uint8_t  LCDRAM2              :1;
            __IO   uint8_t  LCDRAM3              :1;
            __IO   uint8_t  LCDRAM4              :1;
            __IO   uint8_t  LCDRAM5              :1;
            __IO   uint8_t  LCDRAM6              :1;
            __IO   uint8_t  LCDRAM7              :1;
        };
    };
} stc_lcdc_lcdram29_field_t;

typedef struct stc_lcdc_lcdram30_field
{
    union {
        struct {
            __IO   uint8_t  LCDRAM               :8;
        };
        struct {
            __IO   uint8_t  LCDRAM0              :1;
            __IO   uint8_t  LCDRAM1              :1;
            __IO   uint8_t  LCDRAM2              :1;
            __IO   uint8_t  LCDRAM3              :1;
            __IO   uint8_t  LCDRAM4              :1;
            __IO   uint8_t  LCDRAM5              :1;
            __IO   uint8_t  LCDRAM6              :1;
            __IO   uint8_t  LCDRAM7              :1;
        };
    };
} stc_lcdc_lcdram30_field_t;

typedef struct stc_lcdc_lcdram31_field
{
    union {
        struct {
            __IO   uint8_t  LCDRAM               :8;
        };
        struct {
            __IO   uint8_t  LCDRAM0              :1;
            __IO   uint8_t  LCDRAM1              :1;
            __IO   uint8_t  LCDRAM2              :1;
            __IO   uint8_t  LCDRAM3              :1;
            __IO   uint8_t  LCDRAM4              :1;
            __IO   uint8_t  LCDRAM5              :1;
            __IO   uint8_t  LCDRAM6              :1;
            __IO   uint8_t  LCDRAM7              :1;
        };
    };
} stc_lcdc_lcdram31_field_t;

typedef struct stc_lcdc_lcdram32_field
{
    union {
        struct {
            __IO   uint8_t  LCDRAM               :8;
        };
        struct {
            __IO   uint8_t  LCDRAM0              :1;
            __IO   uint8_t  LCDRAM1              :1;
            __IO   uint8_t  LCDRAM2              :1;
            __IO   uint8_t  LCDRAM3              :1;
            __IO   uint8_t  LCDRAM4              :1;
            __IO   uint8_t  LCDRAM5              :1;
            __IO   uint8_t  LCDRAM6              :1;
            __IO   uint8_t  LCDRAM7              :1;
        };
    };
} stc_lcdc_lcdram32_field_t;

typedef struct stc_lcdc_lcdram33_field
{
    union {
        struct {
            __IO   uint8_t  LCDRAM               :8;
        };
        struct {
            __IO   uint8_t  LCDRAM0              :1;
            __IO   uint8_t  LCDRAM1              :1;
            __IO   uint8_t  LCDRAM2              :1;
            __IO   uint8_t  LCDRAM3              :1;
            __IO   uint8_t  LCDRAM4              :1;
            __IO   uint8_t  LCDRAM5              :1;
            __IO   uint8_t  LCDRAM6              :1;
            __IO   uint8_t  LCDRAM7              :1;
        };
    };
} stc_lcdc_lcdram33_field_t;

typedef struct stc_lcdc_lcdram34_field
{
    union {
        struct {
            __IO   uint8_t  LCDRAM               :8;
        };
        struct {
            __IO   uint8_t  LCDRAM0              :1;
            __IO   uint8_t  LCDRAM1              :1;
            __IO   uint8_t  LCDRAM2              :1;
            __IO   uint8_t  LCDRAM3              :1;
            __IO   uint8_t  LCDRAM4              :1;
            __IO   uint8_t  LCDRAM5              :1;
            __IO   uint8_t  LCDRAM6              :1;
            __IO   uint8_t  LCDRAM7              :1;
        };
    };
} stc_lcdc_lcdram34_field_t;

typedef struct stc_lcdc_lcdram35_field
{
    union {
        struct {
            __IO   uint8_t  LCDRAM               :8;
        };
        struct {
            __IO   uint8_t  LCDRAM0              :1;
            __IO   uint8_t  LCDRAM1              :1;
            __IO   uint8_t  LCDRAM2              :1;
            __IO   uint8_t  LCDRAM3              :1;
            __IO   uint8_t  LCDRAM4              :1;
            __IO   uint8_t  LCDRAM5              :1;
            __IO   uint8_t  LCDRAM6              :1;
            __IO   uint8_t  LCDRAM7              :1;
        };
    };
} stc_lcdc_lcdram35_field_t;

typedef struct stc_lcdc_lcdram36_field
{
    union {
        struct {
            __IO   uint8_t  LCDRAM               :8;
        };
        struct {
            __IO   uint8_t  LCDRAM0              :1;
            __IO   uint8_t  LCDRAM1              :1;
            __IO   uint8_t  LCDRAM2              :1;
            __IO   uint8_t  LCDRAM3              :1;
            __IO   uint8_t  LCDRAM4              :1;
            __IO   uint8_t  LCDRAM5              :1;
            __IO   uint8_t  LCDRAM6              :1;
            __IO   uint8_t  LCDRAM7              :1;
        };
    };
} stc_lcdc_lcdram36_field_t;

typedef struct stc_lcdc_lcdram37_field
{
    union {
        struct {
            __IO   uint8_t  LCDRAM               :8;
        };
        struct {
            __IO   uint8_t  LCDRAM0              :1;
            __IO   uint8_t  LCDRAM1              :1;
            __IO   uint8_t  LCDRAM2              :1;
            __IO   uint8_t  LCDRAM3              :1;
            __IO   uint8_t  LCDRAM4              :1;
            __IO   uint8_t  LCDRAM5              :1;
            __IO   uint8_t  LCDRAM6              :1;
            __IO   uint8_t  LCDRAM7              :1;
        };
    };
} stc_lcdc_lcdram37_field_t;

typedef struct stc_lcdc_lcdram38_field
{
    union {
        struct {
            __IO   uint8_t  LCDRAM               :8;
        };
        struct {
            __IO   uint8_t  LCDRAM0              :1;
            __IO   uint8_t  LCDRAM1              :1;
            __IO   uint8_t  LCDRAM2              :1;
            __IO   uint8_t  LCDRAM3              :1;
            __IO   uint8_t  LCDRAM4              :1;
            __IO   uint8_t  LCDRAM5              :1;
            __IO   uint8_t  LCDRAM6              :1;
            __IO   uint8_t  LCDRAM7              :1;
        };
    };
} stc_lcdc_lcdram38_field_t;

typedef struct stc_lcdc_lcdram39_field
{
    union {
        struct {
            __IO   uint8_t  LCDRAM               :8;
        };
        struct {
            __IO   uint8_t  LCDRAM0              :1;
            __IO   uint8_t  LCDRAM1              :1;
            __IO   uint8_t  LCDRAM2              :1;
            __IO   uint8_t  LCDRAM3              :1;
            __IO   uint8_t  LCDRAM4              :1;
            __IO   uint8_t  LCDRAM5              :1;
            __IO   uint8_t  LCDRAM6              :1;
            __IO   uint8_t  LCDRAM7              :1;
        };
    };
} stc_lcdc_lcdram39_field_t;

