mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1b8xf/common/s6e1b8xf.h
/*******************************************************************************
* LCDC_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
    union {
        __IO  uint8_t LCDCC1;
        stc_lcdc_lcdcc1_field_t LCDCC1_f;
    };
    union {
        __IO  uint8_t LCDCC2;
        stc_lcdc_lcdcc2_field_t LCDCC2_f;
    };
    union {
        __IO  uint8_t LCDCC3;
        stc_lcdc_lcdcc3_field_t LCDCC3_f;
    };
        __IO  uint8_t RESERVED0[1];
    union {
        __IO uint32_t LCDC_PSR;
        stc_lcdc_lcdc_psr_field_t LCDC_PSR_f;
        struct {
          union {
            __IO uint16_t LCDC_PSRL;
            struct {
              __IO uint8_t LCDC_PSRLL;
              __IO uint8_t LCDC_PSRLH;
            };
          };
          union {
            __IO uint16_t LCDC_PSRH;
            struct {
              __IO uint8_t LCDC_PSRHL;
              __IO uint8_t LCDC_PSRHH;
            };
          };
        };
    };
    union {
        __IO  uint8_t LCDC_COMEN;
        stc_lcdc_lcdc_comen_field_t LCDC_COMEN_f;
    };
        __IO  uint8_t RESERVED1[3];
    union {
        __IO uint32_t LCDC_SEGEN1;
        stc_lcdc_lcdc_segen1_field_t LCDC_SEGEN1_f;
        struct {
          union {
            __IO uint16_t LCDC_SEGEN1L;
            struct {
              __IO uint8_t LCDC_SEGEN1LL;
              __IO uint8_t LCDC_SEGEN1LH;
            };
          };
          union {
            __IO uint16_t LCDC_SEGEN1H;
            struct {
              __IO uint8_t LCDC_SEGEN1HL;
              __IO uint8_t LCDC_SEGEN1HH;
            };
          };
        };
    };
    union {
        __IO  uint8_t LCDC_SEGEN2;
        stc_lcdc_lcdc_segen2_field_t LCDC_SEGEN2_f;
    };
        __IO  uint8_t RESERVED2[3];
    union {
        __IO uint16_t LCDC_BLINK;
        stc_lcdc_lcdc_blink_field_t LCDC_BLINK_f;
        struct {
            __IO  uint8_t LCDC_BLINKL;
            __IO  uint8_t LCDC_BLINKH;
        };
    };
        __IO  uint8_t RESERVED3[2];
    union {
        __IO uint16_t LCDC_BOOSTER;
        stc_lcdc_lcdc_booster_field_t LCDC_BOOSTER_f;
        struct {
            __IO  uint8_t LCDC_BOOSTERL;
            __IO  uint8_t LCDC_BOOSTERH;
        };
    };
        __IO  uint8_t RESERVED4[2];
    union {
        __IO  uint8_t LCDRAM00;
        stc_lcdc_lcdram00_field_t LCDRAM00_f;
    };
    union {
        __IO  uint8_t LCDRAM01;
        stc_lcdc_lcdram01_field_t LCDRAM01_f;
    };
    union {
        __IO  uint8_t LCDRAM02;
        stc_lcdc_lcdram02_field_t LCDRAM02_f;
    };
    union {
        __IO  uint8_t LCDRAM03;
        stc_lcdc_lcdram03_field_t LCDRAM03_f;
    };
    union {
        __IO  uint8_t LCDRAM04;
        stc_lcdc_lcdram04_field_t LCDRAM04_f;
    };
    union {
        __IO  uint8_t LCDRAM05;
        stc_lcdc_lcdram05_field_t LCDRAM05_f;
    };
    union {
        __IO  uint8_t LCDRAM06;
        stc_lcdc_lcdram06_field_t LCDRAM06_f;
    };
    union {
        __IO  uint8_t LCDRAM07;
        stc_lcdc_lcdram07_field_t LCDRAM07_f;
    };
    union {
        __IO  uint8_t LCDRAM08;
        stc_lcdc_lcdram08_field_t LCDRAM08_f;
    };
    union {
        __IO  uint8_t LCDRAM09;
        stc_lcdc_lcdram09_field_t LCDRAM09_f;
    };
    union {
        __IO  uint8_t LCDRAM10;
        stc_lcdc_lcdram10_field_t LCDRAM10_f;
    };
    union {
        __IO  uint8_t LCDRAM11;
        stc_lcdc_lcdram11_field_t LCDRAM11_f;
    };
    union {
        __IO  uint8_t LCDRAM12;
        stc_lcdc_lcdram12_field_t LCDRAM12_f;
    };
    union {
        __IO  uint8_t LCDRAM13;
        stc_lcdc_lcdram13_field_t LCDRAM13_f;
    };
    union {
        __IO  uint8_t LCDRAM14;
        stc_lcdc_lcdram14_field_t LCDRAM14_f;
    };
    union {
        __IO  uint8_t LCDRAM15;
        stc_lcdc_lcdram15_field_t LCDRAM15_f;
    };
    union {
        __IO  uint8_t LCDRAM16;
        stc_lcdc_lcdram16_field_t LCDRAM16_f;
    };
    union {
        __IO  uint8_t LCDRAM17;
        stc_lcdc_lcdram17_field_t LCDRAM17_f;
    };
    union {
        __IO  uint8_t LCDRAM18;
        stc_lcdc_lcdram18_field_t LCDRAM18_f;
    };
    union {
        __IO  uint8_t LCDRAM19;
        stc_lcdc_lcdram19_field_t LCDRAM19_f;
    };
    union {
        __IO  uint8_t LCDRAM20;
        stc_lcdc_lcdram20_field_t LCDRAM20_f;
    };
    union {
        __IO  uint8_t LCDRAM21;
        stc_lcdc_lcdram21_field_t LCDRAM21_f;
    };
    union {
        __IO  uint8_t LCDRAM22;
        stc_lcdc_lcdram22_field_t LCDRAM22_f;
    };
    union {
        __IO  uint8_t LCDRAM23;
        stc_lcdc_lcdram23_field_t LCDRAM23_f;
    };
    union {
        __IO  uint8_t LCDRAM24;
        stc_lcdc_lcdram24_field_t LCDRAM24_f;
    };
    union {
        __IO  uint8_t LCDRAM25;
        stc_lcdc_lcdram25_field_t LCDRAM25_f;
    };
    union {
        __IO  uint8_t LCDRAM26;
        stc_lcdc_lcdram26_field_t LCDRAM26_f;
    };
    union {
        __IO  uint8_t LCDRAM27;
        stc_lcdc_lcdram27_field_t LCDRAM27_f;
    };
    union {
        __IO  uint8_t LCDRAM28;
        stc_lcdc_lcdram28_field_t LCDRAM28_f;
    };
    union {
        __IO  uint8_t LCDRAM29;
        stc_lcdc_lcdram29_field_t LCDRAM29_f;
    };
    union {
        __IO  uint8_t LCDRAM30;
        stc_lcdc_lcdram30_field_t LCDRAM30_f;
    };
    union {
        __IO  uint8_t LCDRAM31;
        stc_lcdc_lcdram31_field_t LCDRAM31_f;
    };
    union {
        __IO  uint8_t LCDRAM32;
        stc_lcdc_lcdram32_field_t LCDRAM32_f;
    };
    union {
        __IO  uint8_t LCDRAM33;
        stc_lcdc_lcdram33_field_t LCDRAM33_f;
    };
    union {
        __IO  uint8_t LCDRAM34;
        stc_lcdc_lcdram34_field_t LCDRAM34_f;
    };
    union {
        __IO  uint8_t LCDRAM35;
        stc_lcdc_lcdram35_field_t LCDRAM35_f;
    };
    union {
        __IO  uint8_t LCDRAM36;
        stc_lcdc_lcdram36_field_t LCDRAM36_f;
    };
    union {
        __IO  uint8_t LCDRAM37;
        stc_lcdc_lcdram37_field_t LCDRAM37_f;
    };
    union {
        __IO  uint8_t LCDRAM38;
        stc_lcdc_lcdram38_field_t LCDRAM38_f;
    };
    union {
        __IO  uint8_t LCDRAM39;
        stc_lcdc_lcdram39_field_t LCDRAM39_f;
    };
} FM_LCDC_TypeDef, FM0P_LCDC_TypeDef;

