mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1b8xf/common/s6e1b8xf.h
#define bFM_GPIO_PZR2_P0                          *((volatile  uint8_t *)(0x4266E100UL))
#define bFM0P_GPIO_PZR2_P0                        *((volatile  uint8_t *)(0x4266E100UL))
#define bFM_GPIO_PZR2_P1                          *((volatile  uint8_t *)(0x4266E104UL))
#define bFM0P_GPIO_PZR2_P1                        *((volatile  uint8_t *)(0x4266E104UL))
#define bFM_GPIO_PZR2_P2                          *((volatile  uint8_t *)(0x4266E108UL))
#define bFM0P_GPIO_PZR2_P2                        *((volatile  uint8_t *)(0x4266E108UL))
#define bFM_GPIO_PZR2_P3                          *((volatile  uint8_t *)(0x4266E10CUL))
#define bFM0P_GPIO_PZR2_P3                        *((volatile  uint8_t *)(0x4266E10CUL))

#define bFM_GPIO_PZR3_P0                          *((volatile  uint8_t *)(0x4266E180UL))
#define bFM0P_GPIO_PZR3_P0                        *((volatile  uint8_t *)(0x4266E180UL))
#define bFM_GPIO_PZR3_P1                          *((volatile  uint8_t *)(0x4266E184UL))
#define bFM0P_GPIO_PZR3_P1                        *((volatile  uint8_t *)(0x4266E184UL))
#define bFM_GPIO_PZR3_P2                          *((volatile  uint8_t *)(0x4266E188UL))
#define bFM0P_GPIO_PZR3_P2                        *((volatile  uint8_t *)(0x4266E188UL))
#define bFM_GPIO_PZR3_P3                          *((volatile  uint8_t *)(0x4266E18CUL))
#define bFM0P_GPIO_PZR3_P3                        *((volatile  uint8_t *)(0x4266E18CUL))
#define bFM_GPIO_PZR3_P4                          *((volatile  uint8_t *)(0x4266E190UL))
#define bFM0P_GPIO_PZR3_P4                        *((volatile  uint8_t *)(0x4266E190UL))
#define bFM_GPIO_PZR3_P5                          *((volatile  uint8_t *)(0x4266E194UL))
#define bFM0P_GPIO_PZR3_P5                        *((volatile  uint8_t *)(0x4266E194UL))
#define bFM_GPIO_PZR3_P6                          *((volatile  uint8_t *)(0x4266E198UL))
#define bFM0P_GPIO_PZR3_P6                        *((volatile  uint8_t *)(0x4266E198UL))
#define bFM_GPIO_PZR3_P7                          *((volatile  uint8_t *)(0x4266E19CUL))
#define bFM0P_GPIO_PZR3_P7                        *((volatile  uint8_t *)(0x4266E19CUL))
#define bFM_GPIO_PZR3_P8                          *((volatile  uint8_t *)(0x4266E1A0UL))
#define bFM0P_GPIO_PZR3_P8                        *((volatile  uint8_t *)(0x4266E1A0UL))
#define bFM_GPIO_PZR3_P9                          *((volatile  uint8_t *)(0x4266E1A4UL))
#define bFM0P_GPIO_PZR3_P9                        *((volatile  uint8_t *)(0x4266E1A4UL))
#define bFM_GPIO_PZR3_PA                          *((volatile  uint8_t *)(0x4266E1A8UL))
#define bFM0P_GPIO_PZR3_PA                        *((volatile  uint8_t *)(0x4266E1A8UL))
#define bFM_GPIO_PZR3_PB                          *((volatile  uint8_t *)(0x4266E1ACUL))
#define bFM0P_GPIO_PZR3_PB                        *((volatile  uint8_t *)(0x4266E1ACUL))
#define bFM_GPIO_PZR3_PC                          *((volatile  uint8_t *)(0x4266E1B0UL))
#define bFM0P_GPIO_PZR3_PC                        *((volatile  uint8_t *)(0x4266E1B0UL))
#define bFM_GPIO_PZR3_PD                          *((volatile  uint8_t *)(0x4266E1B4UL))
#define bFM0P_GPIO_PZR3_PD                        *((volatile  uint8_t *)(0x4266E1B4UL))
#define bFM_GPIO_PZR3_PE                          *((volatile  uint8_t *)(0x4266E1B8UL))
#define bFM0P_GPIO_PZR3_PE                        *((volatile  uint8_t *)(0x4266E1B8UL))
#define bFM_GPIO_PZR3_PF                          *((volatile  uint8_t *)(0x4266E1BCUL))
#define bFM0P_GPIO_PZR3_PF                        *((volatile  uint8_t *)(0x4266E1BCUL))

#define bFM_GPIO_PZR4_P0                          *((volatile  uint8_t *)(0x4266E200UL))
#define bFM0P_GPIO_PZR4_P0                        *((volatile  uint8_t *)(0x4266E200UL))
#define bFM_GPIO_PZR4_P1                          *((volatile  uint8_t *)(0x4266E204UL))
#define bFM0P_GPIO_PZR4_P1                        *((volatile  uint8_t *)(0x4266E204UL))
#define bFM_GPIO_PZR4_P2                          *((volatile  uint8_t *)(0x4266E208UL))
#define bFM0P_GPIO_PZR4_P2                        *((volatile  uint8_t *)(0x4266E208UL))
#define bFM_GPIO_PZR4_P3                          *((volatile  uint8_t *)(0x4266E20CUL))
#define bFM0P_GPIO_PZR4_P3                        *((volatile  uint8_t *)(0x4266E20CUL))
#define bFM_GPIO_PZR4_P4                          *((volatile  uint8_t *)(0x4266E210UL))
#define bFM0P_GPIO_PZR4_P4                        *((volatile  uint8_t *)(0x4266E210UL))
#define bFM_GPIO_PZR4_P5                          *((volatile  uint8_t *)(0x4266E214UL))
#define bFM0P_GPIO_PZR4_P5                        *((volatile  uint8_t *)(0x4266E214UL))
#define bFM_GPIO_PZR4_P6                          *((volatile  uint8_t *)(0x4266E218UL))
#define bFM0P_GPIO_PZR4_P6                        *((volatile  uint8_t *)(0x4266E218UL))
#define bFM_GPIO_PZR4_P7                          *((volatile  uint8_t *)(0x4266E21CUL))
#define bFM0P_GPIO_PZR4_P7                        *((volatile  uint8_t *)(0x4266E21CUL))
#define bFM_GPIO_PZR4_P8                          *((volatile  uint8_t *)(0x4266E220UL))
#define bFM0P_GPIO_PZR4_P8                        *((volatile  uint8_t *)(0x4266E220UL))
#define bFM_GPIO_PZR4_P9                          *((volatile  uint8_t *)(0x4266E224UL))
#define bFM0P_GPIO_PZR4_P9                        *((volatile  uint8_t *)(0x4266E224UL))
#define bFM_GPIO_PZR4_PA                          *((volatile  uint8_t *)(0x4266E228UL))
#define bFM0P_GPIO_PZR4_PA                        *((volatile  uint8_t *)(0x4266E228UL))
#define bFM_GPIO_PZR4_PB                          *((volatile  uint8_t *)(0x4266E22CUL))
#define bFM0P_GPIO_PZR4_PB                        *((volatile  uint8_t *)(0x4266E22CUL))
#define bFM_GPIO_PZR4_PC                          *((volatile  uint8_t *)(0x4266E230UL))
#define bFM0P_GPIO_PZR4_PC                        *((volatile  uint8_t *)(0x4266E230UL))
#define bFM_GPIO_PZR4_PD                          *((volatile  uint8_t *)(0x4266E234UL))
#define bFM0P_GPIO_PZR4_PD                        *((volatile  uint8_t *)(0x4266E234UL))

#define bFM_GPIO_PZR5_P0                          *((volatile  uint8_t *)(0x4266E280UL))
#define bFM0P_GPIO_PZR5_P0                        *((volatile  uint8_t *)(0x4266E280UL))
#define bFM_GPIO_PZR5_P1                          *((volatile  uint8_t *)(0x4266E284UL))
#define bFM0P_GPIO_PZR5_P1                        *((volatile  uint8_t *)(0x4266E284UL))
#define bFM_GPIO_PZR5_P2                          *((volatile  uint8_t *)(0x4266E288UL))
#define bFM0P_GPIO_PZR5_P2                        *((volatile  uint8_t *)(0x4266E288UL))
#define bFM_GPIO_PZR5_P3                          *((volatile  uint8_t *)(0x4266E28CUL))
#define bFM0P_GPIO_PZR5_P3                        *((volatile  uint8_t *)(0x4266E28CUL))
#define bFM_GPIO_PZR5_P4                          *((volatile  uint8_t *)(0x4266E290UL))
#define bFM0P_GPIO_PZR5_P4                        *((volatile  uint8_t *)(0x4266E290UL))
#define bFM_GPIO_PZR5_P5                          *((volatile  uint8_t *)(0x4266E294UL))
#define bFM0P_GPIO_PZR5_P5                        *((volatile  uint8_t *)(0x4266E294UL))
#define bFM_GPIO_PZR5_P6                          *((volatile  uint8_t *)(0x4266E298UL))
#define bFM0P_GPIO_PZR5_P6                        *((volatile  uint8_t *)(0x4266E298UL))

