mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1b8xf/common/s6e1b8xf.h
#define bFM_MFS5_CSIO_SCSFR0_CS1BDS               *((volatile  uint8_t *)(0x4270A690UL))
#define bFM0P_MFS5_CSIO_SCSFR0_CS1BDS             *((volatile  uint8_t *)(0x4270A690UL))
#define bFM_MFS5_CSIO_SCSFR0_CS1SPI               *((volatile  uint8_t *)(0x4270A694UL))
#define bFM0P_MFS5_CSIO_SCSFR0_CS1SPI             *((volatile  uint8_t *)(0x4270A694UL))
#define bFM_MFS5_CSIO_SCSFR0_CS1SCINV             *((volatile  uint8_t *)(0x4270A698UL))
#define bFM0P_MFS5_CSIO_SCSFR0_CS1SCINV           *((volatile  uint8_t *)(0x4270A698UL))
#define bFM_MFS5_CSIO_SCSFR0_CS1CSLVL             *((volatile  uint8_t *)(0x4270A69CUL))
#define bFM0P_MFS5_CSIO_SCSFR0_CS1CSLVL           *((volatile  uint8_t *)(0x4270A69CUL))

#define bFM_MFS5_CSIO_SCSFR1_CS2BDS               *((volatile  uint8_t *)(0x4270A6B0UL))
#define bFM0P_MFS5_CSIO_SCSFR1_CS2BDS             *((volatile  uint8_t *)(0x4270A6B0UL))
#define bFM_MFS5_CSIO_SCSFR1_CS2SPI               *((volatile  uint8_t *)(0x4270A6B4UL))
#define bFM0P_MFS5_CSIO_SCSFR1_CS2SPI             *((volatile  uint8_t *)(0x4270A6B4UL))
#define bFM_MFS5_CSIO_SCSFR1_CS2SCINV             *((volatile  uint8_t *)(0x4270A6B8UL))
#define bFM0P_MFS5_CSIO_SCSFR1_CS2SCINV           *((volatile  uint8_t *)(0x4270A6B8UL))
#define bFM_MFS5_CSIO_SCSFR1_CS2CSLVL             *((volatile  uint8_t *)(0x4270A6BCUL))
#define bFM0P_MFS5_CSIO_SCSFR1_CS2CSLVL           *((volatile  uint8_t *)(0x4270A6BCUL))

#define bFM_MFS5_CSIO_SCSFR2_CS3BDS               *((volatile  uint8_t *)(0x4270A710UL))
#define bFM0P_MFS5_CSIO_SCSFR2_CS3BDS             *((volatile  uint8_t *)(0x4270A710UL))
#define bFM_MFS5_CSIO_SCSFR2_CS3SPI               *((volatile  uint8_t *)(0x4270A714UL))
#define bFM0P_MFS5_CSIO_SCSFR2_CS3SPI             *((volatile  uint8_t *)(0x4270A714UL))
#define bFM_MFS5_CSIO_SCSFR2_CS3SCINV             *((volatile  uint8_t *)(0x4270A718UL))
#define bFM0P_MFS5_CSIO_SCSFR2_CS3SCINV           *((volatile  uint8_t *)(0x4270A718UL))
#define bFM_MFS5_CSIO_SCSFR2_CS3CSLVL             *((volatile  uint8_t *)(0x4270A71CUL))
#define bFM0P_MFS5_CSIO_SCSFR2_CS3CSLVL           *((volatile  uint8_t *)(0x4270A71CUL))

#define bFM_MFS5_CSIO_SMR_SOE                     *((volatile  uint8_t *)(0x4270A000UL))
#define bFM0P_MFS5_CSIO_SMR_SOE                   *((volatile  uint8_t *)(0x4270A000UL))
#define bFM_MFS5_CSIO_SMR_SCKE                    *((volatile  uint8_t *)(0x4270A004UL))
#define bFM0P_MFS5_CSIO_SMR_SCKE                  *((volatile  uint8_t *)(0x4270A004UL))
#define bFM_MFS5_CSIO_SMR_BDS                     *((volatile  uint8_t *)(0x4270A008UL))
#define bFM0P_MFS5_CSIO_SMR_BDS                   *((volatile  uint8_t *)(0x4270A008UL))
#define bFM_MFS5_CSIO_SMR_SCINV                   *((volatile  uint8_t *)(0x4270A00CUL))
#define bFM0P_MFS5_CSIO_SMR_SCINV                 *((volatile  uint8_t *)(0x4270A00CUL))

#define bFM_MFS5_CSIO_SSR_TBI                     *((volatile  uint8_t *)(0x4270A0A0UL))
#define bFM0P_MFS5_CSIO_SSR_TBI                   *((volatile  uint8_t *)(0x4270A0A0UL))
#define bFM_MFS5_CSIO_SSR_TDRE                    *((volatile  uint8_t *)(0x4270A0A4UL))
#define bFM0P_MFS5_CSIO_SSR_TDRE                  *((volatile  uint8_t *)(0x4270A0A4UL))
#define bFM_MFS5_CSIO_SSR_RDRF                    *((volatile  uint8_t *)(0x4270A0A8UL))
#define bFM0P_MFS5_CSIO_SSR_RDRF                  *((volatile  uint8_t *)(0x4270A0A8UL))
#define bFM_MFS5_CSIO_SSR_ORE                     *((volatile  uint8_t *)(0x4270A0ACUL))
#define bFM0P_MFS5_CSIO_SSR_ORE                   *((volatile  uint8_t *)(0x4270A0ACUL))
#define bFM_MFS5_CSIO_SSR_REC                     *((volatile  uint8_t *)(0x4270A0BCUL))
#define bFM0P_MFS5_CSIO_SSR_REC                   *((volatile  uint8_t *)(0x4270A0BCUL))

#define bFM_MFS5_I2C_EIBCR_BEC                    *((volatile  uint8_t *)(0x4270A3A0UL))
#define bFM0P_MFS5_I2C_EIBCR_BEC                  *((volatile  uint8_t *)(0x4270A3A0UL))
#define bFM_MFS5_I2C_EIBCR_SOCE                   *((volatile  uint8_t *)(0x4270A3A4UL))
#define bFM0P_MFS5_I2C_EIBCR_SOCE                 *((volatile  uint8_t *)(0x4270A3A4UL))
#define bFM_MFS5_I2C_EIBCR_SCLC                   *((volatile  uint8_t *)(0x4270A3A8UL))
#define bFM0P_MFS5_I2C_EIBCR_SCLC                 *((volatile  uint8_t *)(0x4270A3A8UL))
#define bFM_MFS5_I2C_EIBCR_SDAC                   *((volatile  uint8_t *)(0x4270A3ACUL))
#define bFM0P_MFS5_I2C_EIBCR_SDAC                 *((volatile  uint8_t *)(0x4270A3ACUL))
#define bFM_MFS5_I2C_EIBCR_SCLS                   *((volatile  uint8_t *)(0x4270A3B0UL))
#define bFM0P_MFS5_I2C_EIBCR_SCLS                 *((volatile  uint8_t *)(0x4270A3B0UL))
#define bFM_MFS5_I2C_EIBCR_SDAS                   *((volatile  uint8_t *)(0x4270A3B4UL))
#define bFM0P_MFS5_I2C_EIBCR_SDAS                 *((volatile  uint8_t *)(0x4270A3B4UL))

#define bFM_MFS5_I2C_FCR_FE1                      *((volatile  uint8_t *)(0x4270A280UL))
#define bFM0P_MFS5_I2C_FCR_FE1                    *((volatile  uint8_t *)(0x4270A280UL))
#define bFM_MFS5_I2C_FCR_FE2                      *((volatile  uint8_t *)(0x4270A284UL))
#define bFM0P_MFS5_I2C_FCR_FE2                    *((volatile  uint8_t *)(0x4270A284UL))
#define bFM_MFS5_I2C_FCR_FCL1                     *((volatile  uint8_t *)(0x4270A288UL))
#define bFM0P_MFS5_I2C_FCR_FCL1                   *((volatile  uint8_t *)(0x4270A288UL))
#define bFM_MFS5_I2C_FCR_FCL2                     *((volatile  uint8_t *)(0x4270A28CUL))
#define bFM0P_MFS5_I2C_FCR_FCL2                   *((volatile  uint8_t *)(0x4270A28CUL))
#define bFM_MFS5_I2C_FCR_FSET                     *((volatile  uint8_t *)(0x4270A290UL))
#define bFM0P_MFS5_I2C_FCR_FSET                   *((volatile  uint8_t *)(0x4270A290UL))
#define bFM_MFS5_I2C_FCR_FLD                      *((volatile  uint8_t *)(0x4270A294UL))
#define bFM0P_MFS5_I2C_FCR_FLD                    *((volatile  uint8_t *)(0x4270A294UL))
#define bFM_MFS5_I2C_FCR_FLST                     *((volatile  uint8_t *)(0x4270A298UL))
#define bFM0P_MFS5_I2C_FCR_FLST                   *((volatile  uint8_t *)(0x4270A298UL))
#define bFM_MFS5_I2C_FCR_FSEL                     *((volatile  uint8_t *)(0x4270A2A0UL))
#define bFM0P_MFS5_I2C_FCR_FSEL                   *((volatile  uint8_t *)(0x4270A2A0UL))
#define bFM_MFS5_I2C_FCR_FTIE                     *((volatile  uint8_t *)(0x4270A2A4UL))
#define bFM0P_MFS5_I2C_FCR_FTIE                   *((volatile  uint8_t *)(0x4270A2A4UL))
#define bFM_MFS5_I2C_FCR_FDRQ                     *((volatile  uint8_t *)(0x4270A2A8UL))
#define bFM0P_MFS5_I2C_FCR_FDRQ                   *((volatile  uint8_t *)(0x4270A2A8UL))
#define bFM_MFS5_I2C_FCR_FRIIE                    *((volatile  uint8_t *)(0x4270A2ACUL))
#define bFM0P_MFS5_I2C_FCR_FRIIE                  *((volatile  uint8_t *)(0x4270A2ACUL))
#define bFM_MFS5_I2C_FCR_FLSTE                    *((volatile  uint8_t *)(0x4270A2B0UL))
#define bFM0P_MFS5_I2C_FCR_FLSTE                  *((volatile  uint8_t *)(0x4270A2B0UL))

