mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1b8xf/common/s6e1b8xf.h
#define bFM_MFS6_I2S_ESCR_L3                      *((volatile  uint8_t *)(0x4270C098UL))
#define bFM0P_MFS6_I2S_ESCR_L3                    *((volatile  uint8_t *)(0x4270C098UL))
#define bFM_MFS6_I2S_ESCR_SOP                     *((volatile  uint8_t *)(0x4270C09CUL))
#define bFM0P_MFS6_I2S_ESCR_SOP                   *((volatile  uint8_t *)(0x4270C09CUL))

#define bFM_MFS6_I2S_FCR_FE1                      *((volatile  uint8_t *)(0x4270C280UL))
#define bFM0P_MFS6_I2S_FCR_FE1                    *((volatile  uint8_t *)(0x4270C280UL))
#define bFM_MFS6_I2S_FCR_FE2                      *((volatile  uint8_t *)(0x4270C284UL))
#define bFM0P_MFS6_I2S_FCR_FE2                    *((volatile  uint8_t *)(0x4270C284UL))
#define bFM_MFS6_I2S_FCR_FCL1                     *((volatile  uint8_t *)(0x4270C288UL))
#define bFM0P_MFS6_I2S_FCR_FCL1                   *((volatile  uint8_t *)(0x4270C288UL))
#define bFM_MFS6_I2S_FCR_FCL2                     *((volatile  uint8_t *)(0x4270C28CUL))
#define bFM0P_MFS6_I2S_FCR_FCL2                   *((volatile  uint8_t *)(0x4270C28CUL))
#define bFM_MFS6_I2S_FCR_FSEL                     *((volatile  uint8_t *)(0x4270C2A0UL))
#define bFM0P_MFS6_I2S_FCR_FSEL                   *((volatile  uint8_t *)(0x4270C2A0UL))
#define bFM_MFS6_I2S_FCR_FTIE                     *((volatile  uint8_t *)(0x4270C2A4UL))
#define bFM0P_MFS6_I2S_FCR_FTIE                   *((volatile  uint8_t *)(0x4270C2A4UL))
#define bFM_MFS6_I2S_FCR_FDRQ                     *((volatile  uint8_t *)(0x4270C2A8UL))
#define bFM0P_MFS6_I2S_FCR_FDRQ                   *((volatile  uint8_t *)(0x4270C2A8UL))

#define bFM_MFS6_I2S_SCR_TXE                      *((volatile  uint8_t *)(0x4270C020UL))
#define bFM0P_MFS6_I2S_SCR_TXE                    *((volatile  uint8_t *)(0x4270C020UL))
#define bFM_MFS6_I2S_SCR_RXE                      *((volatile  uint8_t *)(0x4270C024UL))
#define bFM0P_MFS6_I2S_SCR_RXE                    *((volatile  uint8_t *)(0x4270C024UL))
#define bFM_MFS6_I2S_SCR_RIE                      *((volatile  uint8_t *)(0x4270C030UL))
#define bFM0P_MFS6_I2S_SCR_RIE                    *((volatile  uint8_t *)(0x4270C030UL))
#define bFM_MFS6_I2S_SCR_MS                       *((volatile  uint8_t *)(0x4270C038UL))
#define bFM0P_MFS6_I2S_SCR_MS                     *((volatile  uint8_t *)(0x4270C038UL))
#define bFM_MFS6_I2S_SCR_UPCL                     *((volatile  uint8_t *)(0x4270C03CUL))
#define bFM0P_MFS6_I2S_SCR_UPCL                   *((volatile  uint8_t *)(0x4270C03CUL))

#define bFM_MFS6_I2S_SMR_SOE                      *((volatile  uint8_t *)(0x4270C000UL))
#define bFM0P_MFS6_I2S_SMR_SOE                    *((volatile  uint8_t *)(0x4270C000UL))
#define bFM_MFS6_I2S_SMR_BDS                      *((volatile  uint8_t *)(0x4270C008UL))
#define bFM0P_MFS6_I2S_SMR_BDS                    *((volatile  uint8_t *)(0x4270C008UL))

#define bFM_MFS6_I2S_SSR_TDRE                     *((volatile  uint8_t *)(0x4270C0A4UL))
#define bFM0P_MFS6_I2S_SSR_TDRE                   *((volatile  uint8_t *)(0x4270C0A4UL))
#define bFM_MFS6_I2S_SSR_RDRF                     *((volatile  uint8_t *)(0x4270C0A8UL))
#define bFM0P_MFS6_I2S_SSR_RDRF                   *((volatile  uint8_t *)(0x4270C0A8UL))
#define bFM_MFS6_I2S_SSR_ORE                      *((volatile  uint8_t *)(0x4270C0ACUL))
#define bFM0P_MFS6_I2S_SSR_ORE                    *((volatile  uint8_t *)(0x4270C0ACUL))
#define bFM_MFS6_I2S_SSR_AWC                      *((volatile  uint8_t *)(0x4270C0B0UL))
#define bFM0P_MFS6_I2S_SSR_AWC                    *((volatile  uint8_t *)(0x4270C0B0UL))
#define bFM_MFS6_I2S_SSR_REC                      *((volatile  uint8_t *)(0x4270C0BCUL))
#define bFM0P_MFS6_I2S_SSR_REC                    *((volatile  uint8_t *)(0x4270C0BCUL))

#define bFM_MFS6_LIN_BGR_EXT                      *((volatile  uint8_t *)(0x4270C1BCUL))
#define bFM0P_MFS6_LIN_BGR_EXT                    *((volatile  uint8_t *)(0x4270C1BCUL))

#define bFM_MFS6_LIN_ESCR_LBIE                    *((volatile  uint8_t *)(0x4270C090UL))
#define bFM0P_MFS6_LIN_ESCR_LBIE                  *((volatile  uint8_t *)(0x4270C090UL))
#define bFM_MFS6_LIN_ESCR_ESBL                    *((volatile  uint8_t *)(0x4270C098UL))
#define bFM0P_MFS6_LIN_ESCR_ESBL                  *((volatile  uint8_t *)(0x4270C098UL))

#define bFM_MFS6_LIN_FCR_FE1                      *((volatile  uint8_t *)(0x4270C280UL))
#define bFM0P_MFS6_LIN_FCR_FE1                    *((volatile  uint8_t *)(0x4270C280UL))
#define bFM_MFS6_LIN_FCR_FE2                      *((volatile  uint8_t *)(0x4270C284UL))
#define bFM0P_MFS6_LIN_FCR_FE2                    *((volatile  uint8_t *)(0x4270C284UL))
#define bFM_MFS6_LIN_FCR_FCL1                     *((volatile  uint8_t *)(0x4270C288UL))
#define bFM0P_MFS6_LIN_FCR_FCL1                   *((volatile  uint8_t *)(0x4270C288UL))
#define bFM_MFS6_LIN_FCR_FCL2                     *((volatile  uint8_t *)(0x4270C28CUL))
#define bFM0P_MFS6_LIN_FCR_FCL2                   *((volatile  uint8_t *)(0x4270C28CUL))
#define bFM_MFS6_LIN_FCR_FSET                     *((volatile  uint8_t *)(0x4270C290UL))
#define bFM0P_MFS6_LIN_FCR_FSET                   *((volatile  uint8_t *)(0x4270C290UL))
#define bFM_MFS6_LIN_FCR_FLD                      *((volatile  uint8_t *)(0x4270C294UL))
#define bFM0P_MFS6_LIN_FCR_FLD                    *((volatile  uint8_t *)(0x4270C294UL))
#define bFM_MFS6_LIN_FCR_FLST                     *((volatile  uint8_t *)(0x4270C298UL))
#define bFM0P_MFS6_LIN_FCR_FLST                   *((volatile  uint8_t *)(0x4270C298UL))
#define bFM_MFS6_LIN_FCR_FSEL                     *((volatile  uint8_t *)(0x4270C2A0UL))
#define bFM0P_MFS6_LIN_FCR_FSEL                   *((volatile  uint8_t *)(0x4270C2A0UL))
#define bFM_MFS6_LIN_FCR_FTIE                     *((volatile  uint8_t *)(0x4270C2A4UL))
#define bFM0P_MFS6_LIN_FCR_FTIE                   *((volatile  uint8_t *)(0x4270C2A4UL))
#define bFM_MFS6_LIN_FCR_FDRQ                     *((volatile  uint8_t *)(0x4270C2A8UL))
#define bFM0P_MFS6_LIN_FCR_FDRQ                   *((volatile  uint8_t *)(0x4270C2A8UL))
#define bFM_MFS6_LIN_FCR_FRIIE                    *((volatile  uint8_t *)(0x4270C2ACUL))
#define bFM0P_MFS6_LIN_FCR_FRIIE                  *((volatile  uint8_t *)(0x4270C2ACUL))
#define bFM_MFS6_LIN_FCR_FLSTE                    *((volatile  uint8_t *)(0x4270C2B0UL))
#define bFM0P_MFS6_LIN_FCR_FLSTE                  *((volatile  uint8_t *)(0x4270C2B0UL))

